zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/ip/cyip_cpuss_v2.h
/***************************************************************************//**
* CPUSS IP definitions
*
********************************************************************************
* \copyright
* (c) 2016-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_CPUSS_V2_H_
#define _CYIP_CPUSS_V2_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                    CPUSS
*******************************************************************************/

#define CPUSS_SECTION_SIZE                      0x00010000UL

/**
  * \brief CPU subsystem (CPUSS) (CPUSS)
  */
typedef struct {
   __IM uint32_t IDENTITY;                      /*!< 0x00000000 Identity */
   __IM uint32_t CM7_0_STATUS;                  /*!< 0x00000004 CM7 0 status */
  __IOM uint32_t FAST_0_CLOCK_CTL;              /*!< 0x00000008 Fast 0 clock control */
  __IOM uint32_t CM7_0_CTL;                     /*!< 0x0000000C CM7 0 control */
   __IM uint32_t RESERVED[60];
   __IM uint32_t CM7_0_INT_STATUS[16];          /*!< 0x00000100 CM7 0 interrupt status */
   __IM uint32_t RESERVED1[48];
  __IOM uint32_t CM7_0_VECTOR_TABLE_BASE;       /*!< 0x00000200 CM7 0 vector table base */
   __IM uint32_t RESERVED2[15];
  __IOM uint32_t CM7_0_NMI_CTL[4];              /*!< 0x00000240 CM7 0 NMI control */
   __IM uint32_t RESERVED3[44];
  __IOM uint32_t UDB_PWR_CTL;                   /*!< 0x00000300 UDB power control */
  __IOM uint32_t UDB_PWR_DELAY_CTL;             /*!< 0x00000304 UDB power control */
   __IM uint32_t RESERVED4[6];
  __IOM uint32_t TRC_DBG_CLOCK_CTL;             /*!< 0x00000320 Trace and debug clock control */
   __IM uint32_t RESERVED5[56];
   __IM uint32_t CM7_1_STATUS;                  /*!< 0x00000404 CM7 1status */
  __IOM uint32_t FAST_1_CLOCK_CTL;              /*!< 0x00000408 Fast 1 clock control */
  __IOM uint32_t CM7_1_CTL;                     /*!< 0x0000040C CM7 1 control */
   __IM uint32_t RESERVED6[60];
   __IM uint32_t CM7_1_INT_STATUS[16];          /*!< 0x00000500 CM7 1 interrupt status */
   __IM uint32_t RESERVED7[48];
  __IOM uint32_t CM7_1_VECTOR_TABLE_BASE;       /*!< 0x00000600 CM7 1 vector table base */
   __IM uint32_t RESERVED8[15];
  __IOM uint32_t CM7_1_NMI_CTL[4];              /*!< 0x00000640 CM7 1 NMI control */
   __IM uint32_t RESERVED9[109];
   __IM uint32_t CM7_2_STATUS;                  /*!< 0x00000804 CM7 2 status */
  __IOM uint32_t FAST_2_CLOCK_CTL;              /*!< 0x00000808 Fast 2 clock control */
  __IOM uint32_t CM7_2_CTL;                     /*!< 0x0000080C CM7 2 control */
   __IM uint32_t RESERVED10[60];
   __IM uint32_t CM7_2_INT_STATUS[16];          /*!< 0x00000900 CM7 2 interrupt status */
   __IM uint32_t RESERVED11[48];
  __IOM uint32_t CM7_2_VECTOR_TABLE_BASE;       /*!< 0x00000A00 CM7 2 vector table base */
   __IM uint32_t RESERVED12[15];
  __IOM uint32_t CM7_2_NMI_CTL[4];              /*!< 0x00000A40 CM7 2 NMI control */
   __IM uint32_t RESERVED13[109];
   __IM uint32_t CM7_3_STATUS;                  /*!< 0x00000C04 CM7 3 status */
  __IOM uint32_t FAST_3_CLOCK_CTL;              /*!< 0x00000C08 Fast 3 clock control */
  __IOM uint32_t CM7_3_CTL;                     /*!< 0x00000C0C CM7 3 control */
   __IM uint32_t RESERVED14[60];
   __IM uint32_t CM7_3_INT_STATUS[16];          /*!< 0x00000D00 CM7 3 interrupt status */
   __IM uint32_t RESERVED15[48];
  __IOM uint32_t CM7_3_VECTOR_TABLE_BASE;       /*!< 0x00000E00 CM7 3 vector table base */
   __IM uint32_t RESERVED16[15];
  __IOM uint32_t CM7_3_NMI_CTL[4];              /*!< 0x00000E40 CM7 3 NMI control */
   __IM uint32_t RESERVED17[108];
  __IOM uint32_t CM0_CTL;                       /*!< 0x00001000 CM0+ control */
   __IM uint32_t CM0_STATUS;                    /*!< 0x00001004 CM0+ status */
  __IOM uint32_t SLOW_CLOCK_CTL;                /*!< 0x00001008 Slow clock control */
  __IOM uint32_t PERI_CLOCK_CTL;                /*!< 0x0000100C Peripheral interconnect clock control */
  __IOM uint32_t MEM_CLOCK_CTL;                 /*!< 0x00001010 Memory clock control */
   __IM uint32_t RESERVED18[59];
   __IM uint32_t CM0_INT0_STATUS;               /*!< 0x00001100 CM0+ interrupt 0 status */
   __IM uint32_t CM0_INT1_STATUS;               /*!< 0x00001104 CM0+ interrupt 1 status */
   __IM uint32_t CM0_INT2_STATUS;               /*!< 0x00001108 CM0+ interrupt 2 status */
   __IM uint32_t CM0_INT3_STATUS;               /*!< 0x0000110C CM0+ interrupt 3 status */
   __IM uint32_t CM0_INT4_STATUS;               /*!< 0x00001110 CM0+ interrupt 4 status */
   __IM uint32_t CM0_INT5_STATUS;               /*!< 0x00001114 CM0+ interrupt 5 status */
   __IM uint32_t CM0_INT6_STATUS;               /*!< 0x00001118 CM0+ interrupt 6 status */
   __IM uint32_t CM0_INT7_STATUS;               /*!< 0x0000111C CM0+ interrupt 7 status */
  __IOM uint32_t CM0_VECTOR_TABLE_BASE;         /*!< 0x00001120 CM0+ vector table base */
   __IM uint32_t RESERVED19[7];
  __IOM uint32_t CM0_NMI_CTL[4];                /*!< 0x00001140 CM0+ NMI control */
   __IM uint32_t RESERVED20[44];
  __IOM uint32_t CM7_0_PWR_CTL;                 /*!< 0x00001200 CM7 0 power control */
  __IOM uint32_t CM7_0_PWR_DELAY_CTL;           /*!< 0x00001204 CM7 0 power delay control */
   __IM uint32_t RESERVED21[2];
  __IOM uint32_t CM7_1_PWR_CTL;                 /*!< 0x00001210 CM7 1 power control */
  __IOM uint32_t CM7_1_PWR_DELAY_CTL;           /*!< 0x00001214 CM7 1 power delay control */
   __IM uint32_t RESERVED22[2];
  __IOM uint32_t CM7_2_PWR_CTL;                 /*!< 0x00001220 CM7 2 power control */
  __IOM uint32_t CM7_2_PWR_DELAY_CTL;           /*!< 0x00001224 CM7 2 power delay control */
   __IM uint32_t RESERVED23[2];
  __IOM uint32_t CM7_3_PWR_CTL;                 /*!< 0x00001230 CM7 3 power control */
  __IOM uint32_t CM7_3_PWR_DELAY_CTL;           /*!< 0x00001234 CM7 3 power delay control */
   __IM uint32_t RESERVED24[50];
  __IOM uint32_t RAM0_CTL0;                     /*!< 0x00001300 RAM 0 control */
   __IM uint32_t RAM0_STATUS;                   /*!< 0x00001304 RAM 0 status */
   __IM uint32_t RESERVED25[14];
  __IOM uint32_t RAM0_PWR_MACRO_CTL[16];        /*!< 0x00001340 RAM 0 power control */
  __IOM uint32_t RAM1_CTL0;                     /*!< 0x00001380 RAM 1 control */
   __IM uint32_t RAM1_STATUS;                   /*!< 0x00001384 RAM 1 status */
  __IOM uint32_t RAM1_PWR_CTL;                  /*!< 0x00001388 RAM 1 power control */
   __IM uint32_t RESERVED26[5];
  __IOM uint32_t RAM2_CTL0;                     /*!< 0x000013A0 RAM 2 control */
   __IM uint32_t RAM2_STATUS;                   /*!< 0x000013A4 RAM 2 status */
  __IOM uint32_t RAM2_PWR_CTL;                  /*!< 0x000013A8 RAM 2 power control */
   __IM uint32_t RESERVED27[5];
  __IOM uint32_t RAM_PWR_DELAY_CTL;             /*!< 0x000013C0 Power up delay used for all SRAM power domains */
  __IOM uint32_t ROM_CTL;                       /*!< 0x000013C4 ROM control */
  __IOM uint32_t ECC_CTL;                       /*!< 0x000013C8 ECC control */
   __IM uint32_t RESERVED28[13];
   __IM uint32_t PRODUCT_ID;                    /*!< 0x00001400 Product identifier and version (same as CoreSight RomTables) */
   __IM uint32_t RESERVED29[3];
   __IM uint32_t DP_STATUS;                     /*!< 0x00001410 Debug port status */
  __IOM uint32_t AP_CTL;                        /*!< 0x00001414 Access port control */
   __IM uint32_t RESERVED30[58];
  __IOM uint32_t BUFF_CTL;                      /*!< 0x00001500 Buffer control */
   __IM uint32_t RESERVED31[63];
  __IOM uint32_t SYSTICK_CTL;                   /*!< 0x00001600 SysTick timer control */
   __IM uint32_t RESERVED32[64];
   __IM uint32_t MBIST_STAT;                    /*!< 0x00001704 Memory BIST status */
   __IM uint32_t RESERVED33[62];
  __IOM uint32_t CAL_SUP_SET;                   /*!< 0x00001800 Calibration support set and read */
  __IOM uint32_t CAL_SUP_CLR;                   /*!< 0x00001804 Calibration support clear and reset */
   __IM uint32_t RESERVED34[510];
  __IOM uint32_t CM0_PC_CTL;                    /*!< 0x00002000 CM0+ protection context control */
   __IM uint32_t RESERVED35[15];
  __IOM uint32_t CM0_PC0_HANDLER;               /*!< 0x00002040 CM0+ protection context 0 handler */
  __IOM uint32_t CM0_PC1_HANDLER;               /*!< 0x00002044 CM0+ protection context 1 handler */
  __IOM uint32_t CM0_PC2_HANDLER;               /*!< 0x00002048 CM0+ protection context 2 handler */
  __IOM uint32_t CM0_PC3_HANDLER;               /*!< 0x0000204C CM0+ protection context 3 handler */
   __IM uint32_t RESERVED36[29];
  __IOM uint32_t PROTECTION;                    /*!< 0x000020C4 Protection status */
   __IM uint32_t RESERVED37[14];
  __IOM uint32_t TRIM_ROM_CTL;                  /*!< 0x00002100 ROM trim control */
  __IOM uint32_t TRIM_RAM_CTL;                  /*!< 0x00002104 RAM trim control for less than 100MHz SRAMs */
  __IOM uint32_t TRIM_RAM200_CTL;               /*!< 0x00002108 RAM trim control for 100MHz - 200MHz SRAMs */
  __IOM uint32_t TRIM_RAM350_CTL;               /*!< 0x0000210C RAM trim control for more than 200MHz SRAMs */
   __IM uint32_t RESERVED38[6076];
  __IOM uint32_t CM0_SYSTEM_INT_CTL[1023];      /*!< 0x00008000 CM0+ system interrupt control */
   __IM uint32_t RESERVED39[1025];
  __IOM uint32_t CM7_0_SYSTEM_INT_CTL[1023];    /*!< 0x0000A000 CM7 0 system interrupt control */
   __IM uint32_t RESERVED40[1025];
  __IOM uint32_t CM7_1_SYSTEM_INT_CTL[1023];    /*!< 0x0000C000 CM7 1 system interrupt control */
   __IM uint32_t RESERVED41;
  __IOM uint32_t CM7_2_SYSTEM_INT_CTL[1023];    /*!< 0x0000D000 CM7 2 system interrupt control */
   __IM uint32_t RESERVED42;
  __IOM uint32_t CM7_3_SYSTEM_INT_CTL[1023];    /*!< 0x0000E000 CM7 3 system interrupt control */
} CPUSS_Type;                                   /*!< Size = 61436 (0xEFFC) */


