zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/ip/cyip_cpuss_v2.h
/* CPUSS.IDENTITY */
#define CPUSS_IDENTITY_P_Pos                    0UL
#define CPUSS_IDENTITY_P_Msk                    0x1UL
#define CPUSS_IDENTITY_NS_Pos                   1UL
#define CPUSS_IDENTITY_NS_Msk                   0x2UL
#define CPUSS_IDENTITY_PC_Pos                   4UL
#define CPUSS_IDENTITY_PC_Msk                   0xF0UL
#define CPUSS_IDENTITY_MS_Pos                   8UL
#define CPUSS_IDENTITY_MS_Msk                   0xF00UL
/* CPUSS.CM7_0_STATUS */
#define CPUSS_CM7_0_STATUS_SLEEPING_Pos         0UL
#define CPUSS_CM7_0_STATUS_SLEEPING_Msk         0x1UL
#define CPUSS_CM7_0_STATUS_SLEEPDEEP_Pos        1UL
#define CPUSS_CM7_0_STATUS_SLEEPDEEP_Msk        0x2UL
#define CPUSS_CM7_0_STATUS_PWR_DONE_Pos         4UL
#define CPUSS_CM7_0_STATUS_PWR_DONE_Msk         0x10UL
#define CPUSS_CM7_0_STATUS_TCMC_CM7_1_MS_Pos    9UL
#define CPUSS_CM7_0_STATUS_TCMC_CM7_1_MS_Msk    0x200UL
#define CPUSS_CM7_0_STATUS_TCMC_EXT_MS_2_TO_0_Pos 10UL
#define CPUSS_CM7_0_STATUS_TCMC_EXT_MS_2_TO_0_Msk 0x400UL
#define CPUSS_CM7_0_STATUS_TCMC_EXT_MS_3_Pos    11UL
#define CPUSS_CM7_0_STATUS_TCMC_EXT_MS_3_Msk    0x800UL
#define CPUSS_CM7_0_STATUS_TCMC_AHB_MS_Pos      12UL
#define CPUSS_CM7_0_STATUS_TCMC_AHB_MS_Msk      0x1000UL
#define CPUSS_CM7_0_STATUS_TCMC_CM7_2_MS_Pos    16UL
#define CPUSS_CM7_0_STATUS_TCMC_CM7_2_MS_Msk    0x10000UL
#define CPUSS_CM7_0_STATUS_TCMC_CM7_3_MS_Pos    17UL
#define CPUSS_CM7_0_STATUS_TCMC_CM7_3_MS_Msk    0x20000UL
/* CPUSS.FAST_0_CLOCK_CTL */
#define CPUSS_FAST_0_CLOCK_CTL_FRAC_DIV_Pos     3UL
#define CPUSS_FAST_0_CLOCK_CTL_FRAC_DIV_Msk     0xF8UL
#define CPUSS_FAST_0_CLOCK_CTL_INT_DIV_Pos      8UL
#define CPUSS_FAST_0_CLOCK_CTL_INT_DIV_Msk      0xFF00UL
/* CPUSS.CM7_0_CTL */
#define CPUSS_CM7_0_CTL_PPB_LOCK_Pos            0UL
#define CPUSS_CM7_0_CTL_PPB_LOCK_Msk            0xFUL
#define CPUSS_CM7_0_CTL_CPU_WAIT_Pos            4UL
#define CPUSS_CM7_0_CTL_CPU_WAIT_Msk            0x10UL
#define CPUSS_CM7_0_CTL_INIT_TCM_EN_Pos         8UL
#define CPUSS_CM7_0_CTL_INIT_TCM_EN_Msk         0x300UL
#define CPUSS_CM7_0_CTL_INIT_RMW_EN_Pos         10UL
#define CPUSS_CM7_0_CTL_INIT_RMW_EN_Msk         0xC00UL
#define CPUSS_CM7_0_CTL_ITCM_ECC_EN_Pos         16UL
#define CPUSS_CM7_0_CTL_ITCM_ECC_EN_Msk         0x10000UL
#define CPUSS_CM7_0_CTL_ITCM_ECC_INJ_EN_Pos     17UL
#define CPUSS_CM7_0_CTL_ITCM_ECC_INJ_EN_Msk     0x20000UL
#define CPUSS_CM7_0_CTL_ITCM_READ_WS_Pos        18UL
#define CPUSS_CM7_0_CTL_ITCM_READ_WS_Msk        0x40000UL
#define CPUSS_CM7_0_CTL_ITCM_ECC_CHECK_DIS_Pos  19UL
#define CPUSS_CM7_0_CTL_ITCM_ECC_CHECK_DIS_Msk  0x80000UL
#define CPUSS_CM7_0_CTL_DTCM_ECC_EN_Pos         20UL
#define CPUSS_CM7_0_CTL_DTCM_ECC_EN_Msk         0x100000UL
#define CPUSS_CM7_0_CTL_DTCM_ECC_INJ_EN_Pos     21UL
#define CPUSS_CM7_0_CTL_DTCM_ECC_INJ_EN_Msk     0x200000UL
#define CPUSS_CM7_0_CTL_DTCM_READ_WS_Pos        22UL
#define CPUSS_CM7_0_CTL_DTCM_READ_WS_Msk        0x400000UL
#define CPUSS_CM7_0_CTL_TCMC_EN_Pos             23UL
#define CPUSS_CM7_0_CTL_TCMC_EN_Msk             0x800000UL
#define CPUSS_CM7_0_CTL_IOC_MASK_Pos            24UL
#define CPUSS_CM7_0_CTL_IOC_MASK_Msk            0x1000000UL
#define CPUSS_CM7_0_CTL_DZC_MASK_Pos            25UL
#define CPUSS_CM7_0_CTL_DZC_MASK_Msk            0x2000000UL
#define CPUSS_CM7_0_CTL_OFC_MASK_Pos            26UL
#define CPUSS_CM7_0_CTL_OFC_MASK_Msk            0x4000000UL
#define CPUSS_CM7_0_CTL_UFC_MASK_Pos            27UL
#define CPUSS_CM7_0_CTL_UFC_MASK_Msk            0x8000000UL
#define CPUSS_CM7_0_CTL_IXC_MASK_Pos            28UL
#define CPUSS_CM7_0_CTL_IXC_MASK_Msk            0x10000000UL
#define CPUSS_CM7_0_CTL_IDC_MASK_Pos            31UL
#define CPUSS_CM7_0_CTL_IDC_MASK_Msk            0x80000000UL
/* CPUSS.CM7_0_INT_STATUS */
#define CPUSS_CM7_0_INT_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM7_0_INT_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM7_0_INT_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM7_0_INT_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM7_0_VECTOR_TABLE_BASE */
#define CPUSS_CM7_0_VECTOR_TABLE_BASE_ADDR25_Pos 7UL
#define CPUSS_CM7_0_VECTOR_TABLE_BASE_ADDR25_Msk 0xFFFFFF80UL
/* CPUSS.CM7_0_NMI_CTL */
#define CPUSS_CM7_0_NMI_CTL_SYSTEM_INT_IDX_Pos  0UL
#define CPUSS_CM7_0_NMI_CTL_SYSTEM_INT_IDX_Msk  0x3FFUL
/* CPUSS.UDB_PWR_CTL */
#define CPUSS_UDB_PWR_CTL_PWR_MODE_Pos          0UL
#define CPUSS_UDB_PWR_CTL_PWR_MODE_Msk          0x3UL
#define CPUSS_UDB_PWR_CTL_VECTKEYSTAT_Pos       16UL
#define CPUSS_UDB_PWR_CTL_VECTKEYSTAT_Msk       0xFFFF0000UL
/* CPUSS.UDB_PWR_DELAY_CTL */
#define CPUSS_UDB_PWR_DELAY_CTL_UP_Pos          0UL
#define CPUSS_UDB_PWR_DELAY_CTL_UP_Msk          0x3FFUL
/* CPUSS.TRC_DBG_CLOCK_CTL */
#define CPUSS_TRC_DBG_CLOCK_CTL_INT_DIV_Pos     8UL
#define CPUSS_TRC_DBG_CLOCK_CTL_INT_DIV_Msk     0xFF00UL
/* CPUSS.CM7_1_STATUS */
#define CPUSS_CM7_1_STATUS_SLEEPING_Pos         0UL
#define CPUSS_CM7_1_STATUS_SLEEPING_Msk         0x1UL
#define CPUSS_CM7_1_STATUS_SLEEPDEEP_Pos        1UL
#define CPUSS_CM7_1_STATUS_SLEEPDEEP_Msk        0x2UL
#define CPUSS_CM7_1_STATUS_PWR_DONE_Pos         4UL
#define CPUSS_CM7_1_STATUS_PWR_DONE_Msk         0x10UL
#define CPUSS_CM7_1_STATUS_TCMC_CM7_0_MS_Pos    8UL
#define CPUSS_CM7_1_STATUS_TCMC_CM7_0_MS_Msk    0x100UL
#define CPUSS_CM7_1_STATUS_TCMC_EXT_MS_2_TO_0_Pos 10UL
#define CPUSS_CM7_1_STATUS_TCMC_EXT_MS_2_TO_0_Msk 0x400UL
#define CPUSS_CM7_1_STATUS_TCMC_EXT_MS_3_Pos    11UL
#define CPUSS_CM7_1_STATUS_TCMC_EXT_MS_3_Msk    0x800UL
#define CPUSS_CM7_1_STATUS_TCMC_AHB_MS_Pos      12UL
#define CPUSS_CM7_1_STATUS_TCMC_AHB_MS_Msk      0x1000UL
#define CPUSS_CM7_1_STATUS_TCMC_CM7_2_MS_Pos    16UL
#define CPUSS_CM7_1_STATUS_TCMC_CM7_2_MS_Msk    0x10000UL
#define CPUSS_CM7_1_STATUS_TCMC_CM7_3_MS_Pos    17UL
#define CPUSS_CM7_1_STATUS_TCMC_CM7_3_MS_Msk    0x20000UL
/* CPUSS.FAST_1_CLOCK_CTL */
#define CPUSS_FAST_1_CLOCK_CTL_FRAC_DIV_Pos     3UL
#define CPUSS_FAST_1_CLOCK_CTL_FRAC_DIV_Msk     0xF8UL
#define CPUSS_FAST_1_CLOCK_CTL_INT_DIV_Pos      8UL
#define CPUSS_FAST_1_CLOCK_CTL_INT_DIV_Msk      0xFF00UL
/* CPUSS.CM7_1_CTL */
#define CPUSS_CM7_1_CTL_PPB_LOCK_Pos            0UL
#define CPUSS_CM7_1_CTL_PPB_LOCK_Msk            0xFUL
#define CPUSS_CM7_1_CTL_CPU_WAIT_Pos            4UL
#define CPUSS_CM7_1_CTL_CPU_WAIT_Msk            0x10UL
#define CPUSS_CM7_1_CTL_INIT_TCM_EN_Pos         8UL
#define CPUSS_CM7_1_CTL_INIT_TCM_EN_Msk         0x300UL
#define CPUSS_CM7_1_CTL_INIT_RMW_EN_Pos         10UL
#define CPUSS_CM7_1_CTL_INIT_RMW_EN_Msk         0xC00UL
#define CPUSS_CM7_1_CTL_ITCM_ECC_EN_Pos         16UL
#define CPUSS_CM7_1_CTL_ITCM_ECC_EN_Msk         0x10000UL
#define CPUSS_CM7_1_CTL_ITCM_ECC_INJ_EN_Pos     17UL
#define CPUSS_CM7_1_CTL_ITCM_ECC_INJ_EN_Msk     0x20000UL
#define CPUSS_CM7_1_CTL_ITCM_READ_WS_Pos        18UL
#define CPUSS_CM7_1_CTL_ITCM_READ_WS_Msk        0x40000UL
#define CPUSS_CM7_1_CTL_ITCM_ECC_CHECK_DIS_Pos  19UL
#define CPUSS_CM7_1_CTL_ITCM_ECC_CHECK_DIS_Msk  0x80000UL
#define CPUSS_CM7_1_CTL_DTCM_ECC_EN_Pos         20UL
#define CPUSS_CM7_1_CTL_DTCM_ECC_EN_Msk         0x100000UL
#define CPUSS_CM7_1_CTL_DTCM_ECC_INJ_EN_Pos     21UL
#define CPUSS_CM7_1_CTL_DTCM_ECC_INJ_EN_Msk     0x200000UL
#define CPUSS_CM7_1_CTL_DTCM_READ_WS_Pos        22UL
#define CPUSS_CM7_1_CTL_DTCM_READ_WS_Msk        0x400000UL
#define CPUSS_CM7_1_CTL_TCMC_EN_Pos             23UL
#define CPUSS_CM7_1_CTL_TCMC_EN_Msk             0x800000UL
#define CPUSS_CM7_1_CTL_IOC_MASK_Pos            24UL
#define CPUSS_CM7_1_CTL_IOC_MASK_Msk            0x1000000UL
#define CPUSS_CM7_1_CTL_DZC_MASK_Pos            25UL
#define CPUSS_CM7_1_CTL_DZC_MASK_Msk            0x2000000UL
#define CPUSS_CM7_1_CTL_OFC_MASK_Pos            26UL
#define CPUSS_CM7_1_CTL_OFC_MASK_Msk            0x4000000UL
#define CPUSS_CM7_1_CTL_UFC_MASK_Pos            27UL
#define CPUSS_CM7_1_CTL_UFC_MASK_Msk            0x8000000UL
#define CPUSS_CM7_1_CTL_IXC_MASK_Pos            28UL
#define CPUSS_CM7_1_CTL_IXC_MASK_Msk            0x10000000UL
#define CPUSS_CM7_1_CTL_IDC_MASK_Pos            31UL
#define CPUSS_CM7_1_CTL_IDC_MASK_Msk            0x80000000UL
/* CPUSS.CM7_1_INT_STATUS */
#define CPUSS_CM7_1_INT_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM7_1_INT_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM7_1_INT_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM7_1_INT_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM7_1_VECTOR_TABLE_BASE */
#define CPUSS_CM7_1_VECTOR_TABLE_BASE_ADDR25_Pos 7UL
#define CPUSS_CM7_1_VECTOR_TABLE_BASE_ADDR25_Msk 0xFFFFFF80UL
/* CPUSS.CM7_1_NMI_CTL */
#define CPUSS_CM7_1_NMI_CTL_SYSTEM_INT_IDX_Pos  0UL
#define CPUSS_CM7_1_NMI_CTL_SYSTEM_INT_IDX_Msk  0x3FFUL
/* CPUSS.CM7_2_STATUS */
#define CPUSS_CM7_2_STATUS_SLEEPING_Pos         0UL
#define CPUSS_CM7_2_STATUS_SLEEPING_Msk         0x1UL
#define CPUSS_CM7_2_STATUS_SLEEPDEEP_Pos        1UL
#define CPUSS_CM7_2_STATUS_SLEEPDEEP_Msk        0x2UL
#define CPUSS_CM7_2_STATUS_PWR_DONE_Pos         4UL
#define CPUSS_CM7_2_STATUS_PWR_DONE_Msk         0x10UL
#define CPUSS_CM7_2_STATUS_TCMC_CM7_0_MS_Pos    8UL
#define CPUSS_CM7_2_STATUS_TCMC_CM7_0_MS_Msk    0x100UL
#define CPUSS_CM7_2_STATUS_TCMC_CM7_1_MS_Pos    9UL
#define CPUSS_CM7_2_STATUS_TCMC_CM7_1_MS_Msk    0x200UL
#define CPUSS_CM7_2_STATUS_TCMC_EXT_MS_2_TO_0_Pos 10UL
#define CPUSS_CM7_2_STATUS_TCMC_EXT_MS_2_TO_0_Msk 0x400UL
#define CPUSS_CM7_2_STATUS_TCMC_EXT_MS_3_Pos    11UL
#define CPUSS_CM7_2_STATUS_TCMC_EXT_MS_3_Msk    0x800UL
#define CPUSS_CM7_2_STATUS_TCMC_AHB_MS_Pos      12UL
#define CPUSS_CM7_2_STATUS_TCMC_AHB_MS_Msk      0x1000UL
#define CPUSS_CM7_2_STATUS_TCMC_CM7_3_MS_Pos    17UL
#define CPUSS_CM7_2_STATUS_TCMC_CM7_3_MS_Msk    0x20000UL
/* CPUSS.FAST_2_CLOCK_CTL */
#define CPUSS_FAST_2_CLOCK_CTL_FRAC_DIV_Pos     3UL
#define CPUSS_FAST_2_CLOCK_CTL_FRAC_DIV_Msk     0xF8UL
#define CPUSS_FAST_2_CLOCK_CTL_INT_DIV_Pos      8UL
#define CPUSS_FAST_2_CLOCK_CTL_INT_DIV_Msk      0xFF00UL
/* CPUSS.CM7_2_CTL */
#define CPUSS_CM7_2_CTL_PPB_LOCK_Pos            0UL
#define CPUSS_CM7_2_CTL_PPB_LOCK_Msk            0xFUL
#define CPUSS_CM7_2_CTL_CPU_WAIT_Pos            4UL
#define CPUSS_CM7_2_CTL_CPU_WAIT_Msk            0x10UL
#define CPUSS_CM7_2_CTL_INIT_TCM_EN_Pos         8UL
#define CPUSS_CM7_2_CTL_INIT_TCM_EN_Msk         0x300UL
#define CPUSS_CM7_2_CTL_INIT_RMW_EN_Pos         10UL
#define CPUSS_CM7_2_CTL_INIT_RMW_EN_Msk         0xC00UL
#define CPUSS_CM7_2_CTL_ITCM_ECC_EN_Pos         16UL
#define CPUSS_CM7_2_CTL_ITCM_ECC_EN_Msk         0x10000UL
#define CPUSS_CM7_2_CTL_ITCM_ECC_INJ_EN_Pos     17UL
#define CPUSS_CM7_2_CTL_ITCM_ECC_INJ_EN_Msk     0x20000UL
#define CPUSS_CM7_2_CTL_ITCM_READ_WS_Pos        18UL
#define CPUSS_CM7_2_CTL_ITCM_READ_WS_Msk        0x40000UL
#define CPUSS_CM7_2_CTL_ITCM_ECC_CHECK_DIS_Pos  19UL
#define CPUSS_CM7_2_CTL_ITCM_ECC_CHECK_DIS_Msk  0x80000UL
#define CPUSS_CM7_2_CTL_DTCM_ECC_EN_Pos         20UL
#define CPUSS_CM7_2_CTL_DTCM_ECC_EN_Msk         0x100000UL
#define CPUSS_CM7_2_CTL_DTCM_ECC_INJ_EN_Pos     21UL
#define CPUSS_CM7_2_CTL_DTCM_ECC_INJ_EN_Msk     0x200000UL
#define CPUSS_CM7_2_CTL_DTCM_READ_WS_Pos        22UL
#define CPUSS_CM7_2_CTL_DTCM_READ_WS_Msk        0x400000UL
#define CPUSS_CM7_2_CTL_TCMC_EN_Pos             23UL
#define CPUSS_CM7_2_CTL_TCMC_EN_Msk             0x800000UL
#define CPUSS_CM7_2_CTL_IOC_MASK_Pos            24UL
#define CPUSS_CM7_2_CTL_IOC_MASK_Msk            0x1000000UL
#define CPUSS_CM7_2_CTL_DZC_MASK_Pos            25UL
#define CPUSS_CM7_2_CTL_DZC_MASK_Msk            0x2000000UL
#define CPUSS_CM7_2_CTL_OFC_MASK_Pos            26UL
#define CPUSS_CM7_2_CTL_OFC_MASK_Msk            0x4000000UL
#define CPUSS_CM7_2_CTL_UFC_MASK_Pos            27UL
#define CPUSS_CM7_2_CTL_UFC_MASK_Msk            0x8000000UL
#define CPUSS_CM7_2_CTL_IXC_MASK_Pos            28UL
#define CPUSS_CM7_2_CTL_IXC_MASK_Msk            0x10000000UL
#define CPUSS_CM7_2_CTL_IDC_MASK_Pos            31UL
#define CPUSS_CM7_2_CTL_IDC_MASK_Msk            0x80000000UL
/* CPUSS.CM7_2_INT_STATUS */
#define CPUSS_CM7_2_INT_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM7_2_INT_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM7_2_INT_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM7_2_INT_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM7_2_VECTOR_TABLE_BASE */
#define CPUSS_CM7_2_VECTOR_TABLE_BASE_ADDR25_Pos 7UL
#define CPUSS_CM7_2_VECTOR_TABLE_BASE_ADDR25_Msk 0xFFFFFF80UL
/* CPUSS.CM7_2_NMI_CTL */
#define CPUSS_CM7_2_NMI_CTL_SYSTEM_INT_IDX_Pos  0UL
#define CPUSS_CM7_2_NMI_CTL_SYSTEM_INT_IDX_Msk  0x3FFUL
/* CPUSS.CM7_3_STATUS */
#define CPUSS_CM7_3_STATUS_SLEEPING_Pos         0UL
#define CPUSS_CM7_3_STATUS_SLEEPING_Msk         0x1UL
#define CPUSS_CM7_3_STATUS_SLEEPDEEP_Pos        1UL
#define CPUSS_CM7_3_STATUS_SLEEPDEEP_Msk        0x2UL
#define CPUSS_CM7_3_STATUS_PWR_DONE_Pos         4UL
#define CPUSS_CM7_3_STATUS_PWR_DONE_Msk         0x10UL
#define CPUSS_CM7_3_STATUS_TCMC_CM7_0_MS_Pos    8UL
#define CPUSS_CM7_3_STATUS_TCMC_CM7_0_MS_Msk    0x100UL
#define CPUSS_CM7_3_STATUS_TCMC_CM7_1_MS_Pos    9UL
#define CPUSS_CM7_3_STATUS_TCMC_CM7_1_MS_Msk    0x200UL
#define CPUSS_CM7_3_STATUS_TCMC_EXT_MS_2_TO_0_Pos 10UL
#define CPUSS_CM7_3_STATUS_TCMC_EXT_MS_2_TO_0_Msk 0x400UL
#define CPUSS_CM7_3_STATUS_TCMC_EXT_MS_3_Pos    11UL
#define CPUSS_CM7_3_STATUS_TCMC_EXT_MS_3_Msk    0x800UL
#define CPUSS_CM7_3_STATUS_TCMC_AHB_MS_Pos      12UL
#define CPUSS_CM7_3_STATUS_TCMC_AHB_MS_Msk      0x1000UL
#define CPUSS_CM7_3_STATUS_TCMC_CM7_2_MS_Pos    16UL
#define CPUSS_CM7_3_STATUS_TCMC_CM7_2_MS_Msk    0x10000UL
/* CPUSS.FAST_3_CLOCK_CTL */
#define CPUSS_FAST_3_CLOCK_CTL_FRAC_DIV_Pos     3UL
#define CPUSS_FAST_3_CLOCK_CTL_FRAC_DIV_Msk     0xF8UL
#define CPUSS_FAST_3_CLOCK_CTL_INT_DIV_Pos      8UL
#define CPUSS_FAST_3_CLOCK_CTL_INT_DIV_Msk      0xFF00UL
/* CPUSS.CM7_3_CTL */
#define CPUSS_CM7_3_CTL_PPB_LOCK_Pos            0UL
#define CPUSS_CM7_3_CTL_PPB_LOCK_Msk            0xFUL
#define CPUSS_CM7_3_CTL_CPU_WAIT_Pos            4UL
#define CPUSS_CM7_3_CTL_CPU_WAIT_Msk            0x10UL
#define CPUSS_CM7_3_CTL_INIT_TCM_EN_Pos         8UL
#define CPUSS_CM7_3_CTL_INIT_TCM_EN_Msk         0x300UL
#define CPUSS_CM7_3_CTL_INIT_RMW_EN_Pos         10UL
#define CPUSS_CM7_3_CTL_INIT_RMW_EN_Msk         0xC00UL
#define CPUSS_CM7_3_CTL_ITCM_ECC_EN_Pos         16UL
#define CPUSS_CM7_3_CTL_ITCM_ECC_EN_Msk         0x10000UL
#define CPUSS_CM7_3_CTL_ITCM_ECC_INJ_EN_Pos     17UL
#define CPUSS_CM7_3_CTL_ITCM_ECC_INJ_EN_Msk     0x20000UL
#define CPUSS_CM7_3_CTL_ITCM_READ_WS_Pos        18UL
#define CPUSS_CM7_3_CTL_ITCM_READ_WS_Msk        0x40000UL
#define CPUSS_CM7_3_CTL_ITCM_ECC_CHECK_DIS_Pos  19UL
#define CPUSS_CM7_3_CTL_ITCM_ECC_CHECK_DIS_Msk  0x80000UL
#define CPUSS_CM7_3_CTL_DTCM_ECC_EN_Pos         20UL
#define CPUSS_CM7_3_CTL_DTCM_ECC_EN_Msk         0x100000UL
#define CPUSS_CM7_3_CTL_DTCM_ECC_INJ_EN_Pos     21UL
#define CPUSS_CM7_3_CTL_DTCM_ECC_INJ_EN_Msk     0x200000UL
#define CPUSS_CM7_3_CTL_DTCM_READ_WS_Pos        22UL
#define CPUSS_CM7_3_CTL_DTCM_READ_WS_Msk        0x400000UL
#define CPUSS_CM7_3_CTL_TCMC_EN_Pos             23UL
#define CPUSS_CM7_3_CTL_TCMC_EN_Msk             0x800000UL
#define CPUSS_CM7_3_CTL_IOC_MASK_Pos            24UL
#define CPUSS_CM7_3_CTL_IOC_MASK_Msk            0x1000000UL
#define CPUSS_CM7_3_CTL_DZC_MASK_Pos            25UL
#define CPUSS_CM7_3_CTL_DZC_MASK_Msk            0x2000000UL
#define CPUSS_CM7_3_CTL_OFC_MASK_Pos            26UL
#define CPUSS_CM7_3_CTL_OFC_MASK_Msk            0x4000000UL
#define CPUSS_CM7_3_CTL_UFC_MASK_Pos            27UL
#define CPUSS_CM7_3_CTL_UFC_MASK_Msk            0x8000000UL
#define CPUSS_CM7_3_CTL_IXC_MASK_Pos            28UL
#define CPUSS_CM7_3_CTL_IXC_MASK_Msk            0x10000000UL
#define CPUSS_CM7_3_CTL_IDC_MASK_Pos            31UL
#define CPUSS_CM7_3_CTL_IDC_MASK_Msk            0x80000000UL
/* CPUSS.CM7_3_INT_STATUS */
#define CPUSS_CM7_3_INT_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM7_3_INT_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM7_3_INT_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM7_3_INT_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM7_3_VECTOR_TABLE_BASE */
#define CPUSS_CM7_3_VECTOR_TABLE_BASE_ADDR25_Pos 7UL
#define CPUSS_CM7_3_VECTOR_TABLE_BASE_ADDR25_Msk 0xFFFFFF80UL
/* CPUSS.CM7_3_NMI_CTL */
#define CPUSS_CM7_3_NMI_CTL_SYSTEM_INT_IDX_Pos  0UL
#define CPUSS_CM7_3_NMI_CTL_SYSTEM_INT_IDX_Msk  0x3FFUL
/* CPUSS.CM0_CTL */
#define CPUSS_CM0_CTL_SLV_STALL_Pos             0UL
#define CPUSS_CM0_CTL_SLV_STALL_Msk             0x1UL
#define CPUSS_CM0_CTL_ENABLED_Pos               1UL
#define CPUSS_CM0_CTL_ENABLED_Msk               0x2UL
#define CPUSS_CM0_CTL_VECTKEYSTAT_Pos           16UL
#define CPUSS_CM0_CTL_VECTKEYSTAT_Msk           0xFFFF0000UL
/* CPUSS.CM0_STATUS */
#define CPUSS_CM0_STATUS_SLEEPING_Pos           0UL
#define CPUSS_CM0_STATUS_SLEEPING_Msk           0x1UL
#define CPUSS_CM0_STATUS_SLEEPDEEP_Pos          1UL
#define CPUSS_CM0_STATUS_SLEEPDEEP_Msk          0x2UL
/* CPUSS.SLOW_CLOCK_CTL */
#define CPUSS_SLOW_CLOCK_CTL_INT_DIV_Pos        8UL
#define CPUSS_SLOW_CLOCK_CTL_INT_DIV_Msk        0xFF00UL
/* CPUSS.PERI_CLOCK_CTL */
#define CPUSS_PERI_CLOCK_CTL_INT_DIV_Pos        8UL
#define CPUSS_PERI_CLOCK_CTL_INT_DIV_Msk        0xFF00UL
/* CPUSS.MEM_CLOCK_CTL */
#define CPUSS_MEM_CLOCK_CTL_INT_DIV_Pos         8UL
#define CPUSS_MEM_CLOCK_CTL_INT_DIV_Msk         0xFF00UL
/* CPUSS.CM0_INT0_STATUS */
#define CPUSS_CM0_INT0_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM0_INT0_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM0_INT0_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM0_INT0_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM0_INT1_STATUS */
#define CPUSS_CM0_INT1_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM0_INT1_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM0_INT1_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM0_INT1_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM0_INT2_STATUS */
#define CPUSS_CM0_INT2_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM0_INT2_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM0_INT2_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM0_INT2_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM0_INT3_STATUS */
#define CPUSS_CM0_INT3_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM0_INT3_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM0_INT3_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM0_INT3_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM0_INT4_STATUS */
#define CPUSS_CM0_INT4_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM0_INT4_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM0_INT4_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM0_INT4_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM0_INT5_STATUS */
#define CPUSS_CM0_INT5_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM0_INT5_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM0_INT5_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM0_INT5_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM0_INT6_STATUS */
#define CPUSS_CM0_INT6_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM0_INT6_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM0_INT6_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM0_INT6_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM0_INT7_STATUS */
#define CPUSS_CM0_INT7_STATUS_SYSTEM_INT_IDX_Pos 0UL
#define CPUSS_CM0_INT7_STATUS_SYSTEM_INT_IDX_Msk 0x3FFUL
#define CPUSS_CM0_INT7_STATUS_SYSTEM_INT_VALID_Pos 31UL
#define CPUSS_CM0_INT7_STATUS_SYSTEM_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM0_VECTOR_TABLE_BASE */
#define CPUSS_CM0_VECTOR_TABLE_BASE_ADDR24_Pos  8UL
#define CPUSS_CM0_VECTOR_TABLE_BASE_ADDR24_Msk  0xFFFFFF00UL
/* CPUSS.CM0_NMI_CTL */
#define CPUSS_CM0_NMI_CTL_SYSTEM_INT_IDX_Pos    0UL
#define CPUSS_CM0_NMI_CTL_SYSTEM_INT_IDX_Msk    0x3FFUL
/* CPUSS.CM7_0_PWR_CTL */
#define CPUSS_CM7_0_PWR_CTL_PWR_MODE_Pos        0UL
#define CPUSS_CM7_0_PWR_CTL_PWR_MODE_Msk        0x3UL
#define CPUSS_CM7_0_PWR_CTL_VECTKEYSTAT_Pos     16UL
#define CPUSS_CM7_0_PWR_CTL_VECTKEYSTAT_Msk     0xFFFF0000UL
/* CPUSS.CM7_0_PWR_DELAY_CTL */
#define CPUSS_CM7_0_PWR_DELAY_CTL_UP_Pos        0UL
#define CPUSS_CM7_0_PWR_DELAY_CTL_UP_Msk        0x3FFUL
/* CPUSS.CM7_1_PWR_CTL */
#define CPUSS_CM7_1_PWR_CTL_PWR_MODE_Pos        0UL
#define CPUSS_CM7_1_PWR_CTL_PWR_MODE_Msk        0x3UL
#define CPUSS_CM7_1_PWR_CTL_VECTKEYSTAT_Pos     16UL
#define CPUSS_CM7_1_PWR_CTL_VECTKEYSTAT_Msk     0xFFFF0000UL
/* CPUSS.CM7_1_PWR_DELAY_CTL */
#define CPUSS_CM7_1_PWR_DELAY_CTL_UP_Pos        0UL
#define CPUSS_CM7_1_PWR_DELAY_CTL_UP_Msk        0x3FFUL
/* CPUSS.CM7_2_PWR_CTL */
#define CPUSS_CM7_2_PWR_CTL_PWR_MODE_Pos        0UL
#define CPUSS_CM7_2_PWR_CTL_PWR_MODE_Msk        0x3UL
#define CPUSS_CM7_2_PWR_CTL_VECTKEYSTAT_Pos     16UL
#define CPUSS_CM7_2_PWR_CTL_VECTKEYSTAT_Msk     0xFFFF0000UL
/* CPUSS.CM7_2_PWR_DELAY_CTL */
#define CPUSS_CM7_2_PWR_DELAY_CTL_UP_Pos        0UL
#define CPUSS_CM7_2_PWR_DELAY_CTL_UP_Msk        0x3FFUL
/* CPUSS.CM7_3_PWR_CTL */
#define CPUSS_CM7_3_PWR_CTL_PWR_MODE_Pos        0UL
#define CPUSS_CM7_3_PWR_CTL_PWR_MODE_Msk        0x3UL
#define CPUSS_CM7_3_PWR_CTL_VECTKEYSTAT_Pos     16UL
#define CPUSS_CM7_3_PWR_CTL_VECTKEYSTAT_Msk     0xFFFF0000UL
/* CPUSS.CM7_3_PWR_DELAY_CTL */
#define CPUSS_CM7_3_PWR_DELAY_CTL_UP_Pos        0UL
#define CPUSS_CM7_3_PWR_DELAY_CTL_UP_Msk        0x3FFUL
/* CPUSS.RAM0_CTL0 */
#define CPUSS_RAM0_CTL0_SLOW_WS_Pos             0UL
#define CPUSS_RAM0_CTL0_SLOW_WS_Msk             0x3UL
#define CPUSS_RAM0_CTL0_FAST_WS_Pos             8UL
#define CPUSS_RAM0_CTL0_FAST_WS_Msk             0x300UL
#define CPUSS_RAM0_CTL0_ECC_EN_Pos              16UL
#define CPUSS_RAM0_CTL0_ECC_EN_Msk              0x10000UL
#define CPUSS_RAM0_CTL0_ECC_AUTO_CORRECT_Pos    17UL
#define CPUSS_RAM0_CTL0_ECC_AUTO_CORRECT_Msk    0x20000UL
#define CPUSS_RAM0_CTL0_ECC_INJ_EN_Pos          18UL
#define CPUSS_RAM0_CTL0_ECC_INJ_EN_Msk          0x40000UL
#define CPUSS_RAM0_CTL0_ECC_CHECK_DIS_Pos       19UL
#define CPUSS_RAM0_CTL0_ECC_CHECK_DIS_Msk       0x80000UL
/* CPUSS.RAM0_STATUS */
#define CPUSS_RAM0_STATUS_WB_EMPTY_Pos          0UL
#define CPUSS_RAM0_STATUS_WB_EMPTY_Msk          0x1UL
/* CPUSS.RAM0_PWR_MACRO_CTL */
#define CPUSS_RAM0_PWR_MACRO_CTL_PWR_MODE_Pos   0UL
#define CPUSS_RAM0_PWR_MACRO_CTL_PWR_MODE_Msk   0x3UL
#define CPUSS_RAM0_PWR_MACRO_CTL_VECTKEYSTAT_Pos 16UL
#define CPUSS_RAM0_PWR_MACRO_CTL_VECTKEYSTAT_Msk 0xFFFF0000UL
/* CPUSS.RAM1_CTL0 */
#define CPUSS_RAM1_CTL0_SLOW_WS_Pos             0UL
#define CPUSS_RAM1_CTL0_SLOW_WS_Msk             0x3UL
#define CPUSS_RAM1_CTL0_FAST_WS_Pos             8UL
#define CPUSS_RAM1_CTL0_FAST_WS_Msk             0x300UL
#define CPUSS_RAM1_CTL0_ECC_EN_Pos              16UL
#define CPUSS_RAM1_CTL0_ECC_EN_Msk              0x10000UL
#define CPUSS_RAM1_CTL0_ECC_AUTO_CORRECT_Pos    17UL
#define CPUSS_RAM1_CTL0_ECC_AUTO_CORRECT_Msk    0x20000UL
#define CPUSS_RAM1_CTL0_ECC_INJ_EN_Pos          18UL
#define CPUSS_RAM1_CTL0_ECC_INJ_EN_Msk          0x40000UL
#define CPUSS_RAM1_CTL0_ECC_CHECK_DIS_Pos       19UL
#define CPUSS_RAM1_CTL0_ECC_CHECK_DIS_Msk       0x80000UL
/* CPUSS.RAM1_STATUS */
#define CPUSS_RAM1_STATUS_WB_EMPTY_Pos          0UL
#define CPUSS_RAM1_STATUS_WB_EMPTY_Msk          0x1UL
/* CPUSS.RAM1_PWR_CTL */
#define CPUSS_RAM1_PWR_CTL_PWR_MODE_Pos         0UL
#define CPUSS_RAM1_PWR_CTL_PWR_MODE_Msk         0x3UL
#define CPUSS_RAM1_PWR_CTL_VECTKEYSTAT_Pos      16UL
#define CPUSS_RAM1_PWR_CTL_VECTKEYSTAT_Msk      0xFFFF0000UL
/* CPUSS.RAM2_CTL0 */
#define CPUSS_RAM2_CTL0_SLOW_WS_Pos             0UL
#define CPUSS_RAM2_CTL0_SLOW_WS_Msk             0x3UL
#define CPUSS_RAM2_CTL0_FAST_WS_Pos             8UL
#define CPUSS_RAM2_CTL0_FAST_WS_Msk             0x300UL
#define CPUSS_RAM2_CTL0_ECC_EN_Pos              16UL
#define CPUSS_RAM2_CTL0_ECC_EN_Msk              0x10000UL
#define CPUSS_RAM2_CTL0_ECC_AUTO_CORRECT_Pos    17UL
#define CPUSS_RAM2_CTL0_ECC_AUTO_CORRECT_Msk    0x20000UL
#define CPUSS_RAM2_CTL0_ECC_INJ_EN_Pos          18UL
#define CPUSS_RAM2_CTL0_ECC_INJ_EN_Msk          0x40000UL
#define CPUSS_RAM2_CTL0_ECC_CHECK_DIS_Pos       19UL
#define CPUSS_RAM2_CTL0_ECC_CHECK_DIS_Msk       0x80000UL
/* CPUSS.RAM2_STATUS */
