zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/devices/COMPONENT_CAT1C/include/ip/cyip_cpuss_v2.h
#define CPUSS_RAM2_STATUS_WB_EMPTY_Pos          0UL
#define CPUSS_RAM2_STATUS_WB_EMPTY_Msk          0x1UL
/* CPUSS.RAM2_PWR_CTL */
#define CPUSS_RAM2_PWR_CTL_PWR_MODE_Pos         0UL
#define CPUSS_RAM2_PWR_CTL_PWR_MODE_Msk         0x3UL
#define CPUSS_RAM2_PWR_CTL_VECTKEYSTAT_Pos      16UL
#define CPUSS_RAM2_PWR_CTL_VECTKEYSTAT_Msk      0xFFFF0000UL
/* CPUSS.RAM_PWR_DELAY_CTL */
#define CPUSS_RAM_PWR_DELAY_CTL_UP_Pos          0UL
#define CPUSS_RAM_PWR_DELAY_CTL_UP_Msk          0x3FFUL
/* CPUSS.ROM_CTL */
#define CPUSS_ROM_CTL_SLOW_WS_Pos               0UL
#define CPUSS_ROM_CTL_SLOW_WS_Msk               0x3UL
#define CPUSS_ROM_CTL_FAST_WS_Pos               8UL
#define CPUSS_ROM_CTL_FAST_WS_Msk               0x300UL
/* CPUSS.ECC_CTL */
#define CPUSS_ECC_CTL_WORD_ADDR_Pos             0UL
#define CPUSS_ECC_CTL_WORD_ADDR_Msk             0xFFFFFFUL
#define CPUSS_ECC_CTL_PARITY_Pos                24UL
#define CPUSS_ECC_CTL_PARITY_Msk                0xFF000000UL
/* CPUSS.PRODUCT_ID */
#define CPUSS_PRODUCT_ID_FAMILY_ID_Pos          0UL
#define CPUSS_PRODUCT_ID_FAMILY_ID_Msk          0xFFFUL
#define CPUSS_PRODUCT_ID_MAJOR_REV_Pos          16UL
#define CPUSS_PRODUCT_ID_MAJOR_REV_Msk          0xF0000UL
#define CPUSS_PRODUCT_ID_MINOR_REV_Pos          20UL
#define CPUSS_PRODUCT_ID_MINOR_REV_Msk          0xF00000UL
/* CPUSS.DP_STATUS */
#define CPUSS_DP_STATUS_SWJ_CONNECTED_Pos       0UL
#define CPUSS_DP_STATUS_SWJ_CONNECTED_Msk       0x1UL
#define CPUSS_DP_STATUS_SWJ_DEBUG_EN_Pos        1UL
#define CPUSS_DP_STATUS_SWJ_DEBUG_EN_Msk        0x2UL
#define CPUSS_DP_STATUS_SWJ_JTAG_SEL_Pos        2UL
#define CPUSS_DP_STATUS_SWJ_JTAG_SEL_Msk        0x4UL
/* CPUSS.AP_CTL */
#define CPUSS_AP_CTL_CM0_ENABLE_Pos             0UL
#define CPUSS_AP_CTL_CM0_ENABLE_Msk             0x1UL
#define CPUSS_AP_CTL_CM7_ENABLE_Pos             1UL
#define CPUSS_AP_CTL_CM7_ENABLE_Msk             0x2UL
#define CPUSS_AP_CTL_SYS_ENABLE_Pos             2UL
#define CPUSS_AP_CTL_SYS_ENABLE_Msk             0x4UL
#define CPUSS_AP_CTL_CM0_DISABLE_Pos            16UL
#define CPUSS_AP_CTL_CM0_DISABLE_Msk            0x10000UL
#define CPUSS_AP_CTL_CM7_DISABLE_Pos            17UL
#define CPUSS_AP_CTL_CM7_DISABLE_Msk            0x20000UL
#define CPUSS_AP_CTL_SYS_DISABLE_Pos            18UL
#define CPUSS_AP_CTL_SYS_DISABLE_Msk            0x40000UL
/* CPUSS.BUFF_CTL */
#define CPUSS_BUFF_CTL_WRITE_BUFF_Pos           0UL
#define CPUSS_BUFF_CTL_WRITE_BUFF_Msk           0x1UL
/* CPUSS.SYSTICK_CTL */
#define CPUSS_SYSTICK_CTL_TENMS_Pos             0UL
#define CPUSS_SYSTICK_CTL_TENMS_Msk             0xFFFFFFUL
#define CPUSS_SYSTICK_CTL_CLOCK_SOURCE_Pos      24UL
#define CPUSS_SYSTICK_CTL_CLOCK_SOURCE_Msk      0x3000000UL
#define CPUSS_SYSTICK_CTL_SKEW_Pos              30UL
#define CPUSS_SYSTICK_CTL_SKEW_Msk              0x40000000UL
#define CPUSS_SYSTICK_CTL_NOREF_Pos             31UL
#define CPUSS_SYSTICK_CTL_NOREF_Msk             0x80000000UL
/* CPUSS.MBIST_STAT */
#define CPUSS_MBIST_STAT_SFP_READY_Pos          0UL
#define CPUSS_MBIST_STAT_SFP_READY_Msk          0x1UL
#define CPUSS_MBIST_STAT_SFP_FAIL_Pos           1UL
#define CPUSS_MBIST_STAT_SFP_FAIL_Msk           0x2UL
/* CPUSS.CAL_SUP_SET */
#define CPUSS_CAL_SUP_SET_DATA_Pos              0UL
#define CPUSS_CAL_SUP_SET_DATA_Msk              0xFFFFFFFFUL
/* CPUSS.CAL_SUP_CLR */
#define CPUSS_CAL_SUP_CLR_DATA_Pos              0UL
#define CPUSS_CAL_SUP_CLR_DATA_Msk              0xFFFFFFFFUL
/* CPUSS.CM0_PC_CTL */
#define CPUSS_CM0_PC_CTL_VALID_Pos              0UL
#define CPUSS_CM0_PC_CTL_VALID_Msk              0xFUL
/* CPUSS.CM0_PC0_HANDLER */
#define CPUSS_CM0_PC0_HANDLER_ADDR_Pos          0UL
#define CPUSS_CM0_PC0_HANDLER_ADDR_Msk          0xFFFFFFFFUL
/* CPUSS.CM0_PC1_HANDLER */
#define CPUSS_CM0_PC1_HANDLER_ADDR_Pos          0UL
#define CPUSS_CM0_PC1_HANDLER_ADDR_Msk          0xFFFFFFFFUL
/* CPUSS.CM0_PC2_HANDLER */
#define CPUSS_CM0_PC2_HANDLER_ADDR_Pos          0UL
#define CPUSS_CM0_PC2_HANDLER_ADDR_Msk          0xFFFFFFFFUL
/* CPUSS.CM0_PC3_HANDLER */
#define CPUSS_CM0_PC3_HANDLER_ADDR_Pos          0UL
#define CPUSS_CM0_PC3_HANDLER_ADDR_Msk          0xFFFFFFFFUL
/* CPUSS.PROTECTION */
#define CPUSS_PROTECTION_STATE_Pos              0UL
#define CPUSS_PROTECTION_STATE_Msk              0x7UL
/* CPUSS.TRIM_ROM_CTL */
#define CPUSS_TRIM_ROM_CTL_TRIM_Pos             0UL
#define CPUSS_TRIM_ROM_CTL_TRIM_Msk             0xFFFFFFFFUL
/* CPUSS.TRIM_RAM_CTL */
#define CPUSS_TRIM_RAM_CTL_TRIM_Pos             0UL
#define CPUSS_TRIM_RAM_CTL_TRIM_Msk             0xFFFFFFFFUL
/* CPUSS.TRIM_RAM200_CTL */
#define CPUSS_TRIM_RAM200_CTL_TRIM_Pos          0UL
#define CPUSS_TRIM_RAM200_CTL_TRIM_Msk          0xFFFFFFFFUL
/* CPUSS.TRIM_RAM350_CTL */
#define CPUSS_TRIM_RAM350_CTL_TRIM_Pos          0UL
#define CPUSS_TRIM_RAM350_CTL_TRIM_Msk          0xFFFFFFFFUL
/* CPUSS.CM0_SYSTEM_INT_CTL */
#define CPUSS_CM0_SYSTEM_INT_CTL_CM0_CPU_INT_IDX_Pos 0UL
#define CPUSS_CM0_SYSTEM_INT_CTL_CM0_CPU_INT_IDX_Msk 0x7UL
#define CPUSS_CM0_SYSTEM_INT_CTL_CPU_INT_VALID_Pos 31UL
#define CPUSS_CM0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM7_0_SYSTEM_INT_CTL */
#define CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_IDX_Pos 0UL
#define CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_IDX_Msk 0xFUL
#define CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_VALID_Pos 31UL
#define CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM7_1_SYSTEM_INT_CTL */
#define CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_IDX_Pos 0UL
#define CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_IDX_Msk 0xFUL
#define CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_VALID_Pos 31UL
#define CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM7_2_SYSTEM_INT_CTL */
#define CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_IDX_Pos 0UL
#define CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_IDX_Msk 0xFUL
#define CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_VALID_Pos 31UL
#define CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_VALID_Msk 0x80000000UL
/* CPUSS.CM7_3_SYSTEM_INT_CTL */
#define CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_IDX_Pos 0UL
#define CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_IDX_Msk 0xFUL
#define CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_VALID_Pos 31UL
#define CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_VALID_Msk 0x80000000UL


#endif /* _CYIP_CPUSS_V2_H_ */


/* [] END OF FILE */
